// 官方系统数据自动同步时间: 2026-06-16 19:00:02
const GRID_UP_TIME = '2026-06-16 19:00:02';

const GRID_INFO = {
    "1": {
        "status": "已完成",
        "inv2025": "",
        "inv2026": "陈培涛",
        "rec2026": "王雨佳",
        "date": "2026-05-23"
    },
    "2": {
        "status": "未认领",
        "inv2025": "",
        "inv2026": "",
        "rec2026": "",
        "date": ""
    },
    "3": {
        "status": "未认领",
        "inv2025": "",
        "inv2026": "",
        "rec2026": "",
        "date": ""
    },
    "4": {
        "status": "已完成",
        "inv2025": "陈汉文",
        "inv2026": "陈汉文",
        "rec2026": "刘燕",
        "date": "2026-06-07"
    },
    "5": {
        "status": "已完成",
        "inv2025": "",
        "inv2026": "汤立群",
        "rec2026": "张学新",
        "date": "2026-05-02"
    },
    "6": {
        "status": "已完成",
        "inv2025": "",
        "inv2026": "叶海兵",
        "rec2026": "孔璇敏",
        "date": "2026-06-07"
    },
    "7": {
        "status": "待调查",
        "inv2025": "",
        "inv2026": "郑炜",
        "rec2026": "郑文郗",
        "date": "2026-06-20"
    },
    "8": {
        "status": "待调查",
        "inv2025": "伍梓柠",
        "inv2026": "沐阳",
        "rec2026": "子明",
        "date": "2026-06-06"
    },
    "9": {
        "status": "已完成",
        "inv2025": "洪琳",
        "inv2026": "洪琳",
        "rec2026": "陈嘉文",
        "date": "2026-04-25"
    },
    "10": {
        "status": "已完成",
        "inv2025": "崔润田",
        "inv2026": "崔润田",
        "rec2026": "李鸿",
        "date": "2026-05-23"
    },
    "11": {
        "status": "已完成",
        "inv2025": "李清泉",
        "inv2026": "邱俊铭",
        "rec2026": "梁畅斐",
        "date": "2026-05-31"
    },
    "12": {
        "status": "已完成",
        "inv2025": "陈汉文",
        "inv2026": "陈汉文",
        "rec2026": "窦婷",
        "date": "2026-05-12"
    },
    "13": {
        "status": "未认领",
        "inv2025": "",
        "inv2026": "",
        "rec2026": "",
        "date": ""
    },
    "14": {
        "status": "未认领",
        "inv2025": "",
        "inv2026": "",
        "rec2026": "",
        "date": ""
    },
    "15": {
        "status": "已完成",
        "inv2025": "蒋文博",
        "inv2026": "蒋文博",
        "rec2026": "蒋枫媛",
        "date": "2026-05-02"
    },
    "16": {
        "status": "已完成",
        "inv2025": "区祥敏",
        "inv2026": "黎雨葳",
        "rec2026": "黄婧妤",
        "date": "2026-05-28"
    },
    "17": {
        "status": "已完成",
        "inv2025": "胡勇婕",
        "inv2026": "曹培莹",
        "rec2026": "谢语晴",
        "date": "2026-06-14"
    },
    "18": {
        "status": "已完成",
        "inv2025": "冯超宝",
        "inv2026": "冯超宝",
        "rec2026": "崔军亚",
        "date": "2026-04-27"
    },
    "19": {
        "status": "已完成",
        "inv2025": "罗天雅",
        "inv2026": "赖辰炫",
        "rec2026": "冯晓斌",
        "date": "2026-05-22"
    },
    "20": {
        "status": "已完成",
        "inv2025": "盛荷苗",
        "inv2026": "叶蕾",
        "rec2026": "朱江玥",
        "date": "2026-06-06"
    },
    "21": {
        "status": "已完成",
        "inv2025": "王彬",
        "inv2026": "冯炳昌",
        "rec2026": "陈金珍",
        "date": "2026-05-30"
    },
    "22": {
        "status": "已完成",
        "inv2025": "",
        "inv2026": "刘守国",
        "rec2026": "王潮漪",
        "date": "2026-05-04"
    },
    "23": {
        "status": "已完成",
        "inv2025": "",
        "inv2026": "冯炳昌",
        "rec2026": "梁峻玮",
        "date": "2026-06-07"
    },
    "24": {
        "status": "已完成",
        "inv2025": "",
        "inv2026": "陈培涛",
        "rec2026": "梁颖琳",
        "date": "2026-06-07"
    },
    "25": {
        "status": "已完成",
        "inv2025": "罗文洋",
        "inv2026": "李诗奇",
        "rec2026": "王晓佳",
        "date": "2026-05-09"
    },
    "26": {
        "status": "已完成",
        "inv2025": "",
        "inv2026": "陈彤",
        "rec2026": "沈若枢",
        "date": "2026-04-30"
    },
    "27": {
        "status": "已完成",
        "inv2025": "",
        "inv2026": "叶海兵",
        "rec2026": "黄桢雅",
        "date": "2026-04-26"
    },
    "28": {
        "status": "已完成",
        "inv2025": "李旭坤",
        "inv2026": "李旭坤",
        "rec2026": "文舒晴",
        "date": "2026-05-10"
    },
    "29": {
        "status": "已完成",
        "inv2025": "刘星池",
        "inv2026": "郑炜",
        "rec2026": "郑文郗",
        "date": "2026-06-07"
    },
    "30": {
        "status": "已完成",
        "inv2025": "谢海莹",
        "inv2026": "谢海莹",
        "rec2026": "肖颖",
        "date": "2026-05-04"
    },
    "31": {
        "status": "已完成",
        "inv2025": "陈桧华",
        "inv2026": "罗天雅",
        "rec2026": "文舒晴",
        "date": "2026-06-11"
    },
    "32": {
        "status": "已完成",
        "inv2025": "",
        "inv2026": "冯炳昌",
        "rec2026": "陈金珍",
        "date": "2026-05-01"
    },
    "33": {
        "status": "已完成",
        "inv2025": "",
        "inv2026": "邱童",
        "rec2026": "董晓燃",
        "date": "2026-04-26"
    },
    "34": {
        "status": "已完成",
        "inv2025": "",
        "inv2026": "李茉莉",
        "rec2026": "郑智健",
        "date": "2026-06-07"
    },
    "35": {
        "status": "已完成",
        "inv2025": "",
        "inv2026": "刘桂霖",
        "rec2026": "李清泉",
        "date": "2026-06-07"
    },
    "36": {
        "status": "已完成",
        "inv2025": "刘瑾青",
        "inv2026": "刘瑾青",
        "rec2026": "许筱凰",
        "date": "2026-05-29"
    },
    "37": {
        "status": "已完成",
        "inv2025": "刘瑾青",
        "inv2026": "刘瑾青",
        "rec2026": "贺文雄",
        "date": "2026-05-13"
    },
    "38": {
        "status": "已完成",
        "inv2025": "江泳",
        "inv2026": "邱童",
        "rec2026": "窦婷",
        "date": "2026-06-14"
    },
    "39": {
        "status": "已完成",
        "inv2025": "郑炜",
        "inv2026": "郑炜",
        "rec2026": "郑文郗",
        "date": "2026-05-02"
    },
    "40": {
        "status": "已完成",
        "inv2025": "江泳",
        "inv2026": "王彬",
        "rec2026": "罗凤英",
        "date": "2026-06-02"
    },
    "41": {
        "status": "已完成",
        "inv2025": "梁周子涵",
        "inv2026": "简鹏飞",
        "rec2026": "禤卿语",
        "date": "2026-05-23"
    },
    "42": {
        "status": "已完成",
        "inv2025": "郭布衣",
        "inv2026": "崔军亚",
        "rec2026": "黄荣杰",
        "date": "2026-06-08"
    },
    "43": {
        "status": "已完成",
        "inv2025": "",
        "inv2026": "黄建粤",
        "rec2026": "陈秋燕",
        "date": "2026-05-10"
    },
    "44": {
        "status": "已完成",
        "inv2025": "",
        "inv2026": "邱童",
        "rec2026": "董晓燃",
        "date": "2026-05-01"
    },
    "45": {
        "status": "已完成",
        "inv2025": "",
        "inv2026": "王彬",
        "rec2026": "赵家宏",
        "date": "2026-05-06"
    },
    "46": {
        "status": "已完成",
        "inv2025": "",
        "inv2026": "曾鹏",
        "rec2026": "罗海燕",
        "date": "2026-06-06"
    },
    "47": {
        "status": "已完成",
        "inv2025": "刘瑾青",
        "inv2026": "刘瑾青",
        "rec2026": "杨艳",
        "date": "2026-05-27"
    },
    "48": {
        "status": "已完成",
        "inv2025": "郑炜",
        "inv2026": "郑炜",
        "rec2026": "郑文郗",
        "date": "2026-05-24"
    },
    "49": {
        "status": "已完成",
        "inv2025": "宋勇",
        "inv2026": "宋勇",
        "rec2026": "杨艳",
        "date": "2026-05-24"
    },
    "50": {
        "status": "已完成",
        "inv2025": "",
        "inv2026": "梁颖琳",
        "rec2026": "吴宪",
        "date": "2026-05-01"
    },
    "51": {
        "status": "已完成",
        "inv2025": "",
        "inv2026": "袁翊朗",
        "rec2026": "刘咪咪",
        "date": "2026-05-04"
    },
    "52": {
        "status": "已完成",
        "inv2025": "",
        "inv2026": "杨柏骅",
        "rec2026": "黄凯骐",
        "date": "2026-05-01"
    },
    "53": {
        "status": "未认领",
        "inv2025": "",
        "inv2026": "",
        "rec2026": "",
        "date": ""
    },
    "54": {
        "status": "未认领",
        "inv2025": "",
        "inv2026": "",
        "rec2026": "",
        "date": ""
    },
    "55": {
        "status": "已完成",
        "inv2025": "",
        "inv2026": "蔡振远",
        "rec2026": "董晓燃",
        "date": "2026-06-12"
    },
    "56": {
        "status": "已完成",
        "inv2025": "",
        "inv2026": "江舸",
        "rec2026": "余美群",
        "date": "2026-05-01"
    },
    "57": {
        "status": "已完成",
        "inv2025": "",
        "inv2026": "郭布衣",
        "rec2026": "王培珍",
        "date": "2026-04-26"
    },
    "58": {
        "status": "已完成",
        "inv2025": "",
        "inv2026": "陈玥彤",
        "rec2026": "冯炳昌",
        "date": "2026-04-26"
    },
    "59": {
        "status": "已完成",
        "inv2025": "江泳",
        "inv2026": "刘瑾青",
        "rec2026": "窦婷",
        "date": "2026-06-03"
    },
    "60": {
        "status": "已完成",
        "inv2025": "宋勇",
        "inv2026": "刘瑾青",
        "rec2026": "杨艳",
        "date": "2026-06-05"
    },
    "61": {
        "status": "已完成",
        "inv2025": "",
        "inv2026": "叶海兵",
        "rec2026": "孔璇敏",
        "date": "2026-05-05"
    },
    "62": {
        "status": "已完成",
        "inv2025": "郭布衣",
        "inv2026": "熊之",
        "rec2026": "冯嘉良",
        "date": "2026-06-07"
    },
    "63": {
        "status": "已完成",
        "inv2025": "谢海莹、郭布衣",
        "inv2026": "郭布衣",
        "rec2026": "冯炳昌",
        "date": "2026-05-24"
    },
    "64": {
        "status": "已完成",
        "inv2025": "",
        "inv2026": "余美群",
        "rec2026": "江舸",
        "date": "2026-05-30"
    },
    "65": {
        "status": "已完成",
        "inv2025": "",
        "inv2026": "刘韵莉",
        "rec2026": "汤立群",
        "date": "2026-05-16"
    },
    "66": {
        "status": "待调查",
        "inv2025": "江泳",
        "inv2026": "罗海燕",
        "rec2026": "赖灶芳",
        "date": "2026-06-20"
    },
    "67": {
        "status": "已完成",
        "inv2025": "",
        "inv2026": "陈培涛",
        "rec2026": "王雨佳",
        "date": "2026-04-26"
    },
    "68": {
        "status": "已完成",
        "inv2025": "江泳",
        "inv2026": "陈汉文",
        "rec2026": "董晓燃",
        "date": "2026-06-05"
    },
    "69": {
        "status": "已完成",
        "inv2025": "",
        "inv2026": "严笑芬",
        "rec2026": "龙茹丹",
        "date": "2026-05-08"
    },
    "70": {
        "status": "已完成",
        "inv2025": "",
        "inv2026": "窦婷",
        "rec2026": "郭倩文",
        "date": "2026-05-25"
    },
    "71": {
        "status": "已完成",
        "inv2025": "",
        "inv2026": "熊之",
        "rec2026": "冯嘉良",
        "date": "2026-05-02"
    },
    "72": {
        "status": "已完成",
        "inv2025": "赖灶芳",
        "inv2026": "赖灶芳",
        "rec2026": "罗海燕",
        "date": "2026-05-03"
    },
    "73": {
        "status": "已完成",
        "inv2025": "",
        "inv2026": "姚彩红",
        "rec2026": "陈桧华",
        "date": "2026-05-22"
    },
    "74": {
        "status": "已完成",
        "inv2025": "",
        "inv2026": "陈彤",
        "rec2026": "徐建敏",
        "date": "2026-05-03"
    },
    "75": {
        "status": "已完成",
        "inv2025": "",
        "inv2026": "罗海燕",
        "rec2026": "赖灶芳",
        "date": "2026-05-23"
    },
    "76": {
        "status": "已完成",
        "inv2025": "",
        "inv2026": "连科",
        "rec2026": "王珂",
        "date": "2026-05-02"
    },
    "77": {
        "status": "已完成",
        "inv2025": "",
        "inv2026": "黎雨葳",
        "rec2026": "赵楚君",
        "date": "2026-05-17"
    },
    "78": {
        "status": "已完成",
        "inv2025": "",
        "inv2026": "谢海莹",
        "rec2026": "黄慧沁",
        "date": "2026-06-01"
    },
    "79": {
        "status": "已完成",
        "inv2025": "",
        "inv2026": "谢海莹",
        "rec2026": "蒋彩玲",
        "date": "2026-05-23"
    },
    "80": {
        "status": "已完成",
        "inv2025": "",
        "inv2026": "姚彩红",
        "rec2026": "董晓燃",
        "date": "2026-05-23"
    },
    "81": {
        "status": "待调查",
        "inv2025": "江泳",
        "inv2026": "江舸",
        "rec2026": "余美群",
        "date": "2026-06-19"
    },
    "82": {
        "status": "已完成",
        "inv2025": "",
        "inv2026": "严笑芬",
        "rec2026": "龙茹丹",
        "date": "2026-05-07"
    }
};
