// GitHub 机器人自动同步时间: 2026-05-20 13:00:02
const GRID_UP_TIME = '2026-05-20 13:00:02';
const GRID_INFO = {
    "1": {
        "status": "待调查",
        "coordinator": "陈培涛(小PT)",
        "inv2025": "",
        "inv2026": "陈培涛",
        "rec2026": "王雨佳",
        "date": "2026年5月23日"
    },
    "2": {
        "status": "未认领",
        "coordinator": "陈培涛(小PT)",
        "inv2025": "",
        "inv2026": "",
        "rec2026": "",
        "date": ""
    },
    "3": {
        "status": "未认领",
        "coordinator": "陈培涛(小PT)",
        "inv2025": "",
        "inv2026": "",
        "rec2026": "",
        "date": ""
    },
    "4": {
        "status": "未认领",
        "coordinator": "陈培涛(小PT)",
        "inv2025": "陈汉文",
        "inv2026": "",
        "rec2026": "",
        "date": ""
    },
    "5": {
        "status": "已完成",
        "coordinator": "",
        "inv2025": "",
        "inv2026": "汤立群",
        "rec2026": "张学新",
        "date": "2026年5月2日"
    },
    "6": {
        "status": "未认领",
        "coordinator": "陈培涛(小PT)",
        "inv2025": "",
        "inv2026": "",
        "rec2026": "",
        "date": ""
    },
    "7": {
        "status": "未认领",
        "coordinator": "陈培涛(小PT)",
        "inv2025": "",
        "inv2026": "",
        "rec2026": "",
        "date": ""
    },
    "8": {
        "status": "未认领",
        "coordinator": "蔡振远(阿暖)",
        "inv2025": "伍梓柠",
        "inv2026": "",
        "rec2026": "",
        "date": ""
    },
    "9": {
        "status": "已完成",
        "coordinator": "",
        "inv2025": "洪琳",
        "inv2026": "洪琳",
        "rec2026": "陈嘉文",
        "date": "2026年4月25日"
    },
    "10": {
        "status": "待调查",
        "coordinator": "蔡振远(阿暖)",
        "inv2025": "崔润田",
        "inv2026": "崔润田",
        "rec2026": "李鸿",
        "date": "2026年5月23日"
    },
    "11": {
        "status": "未认领",
        "coordinator": "陈培涛(小PT)",
        "inv2025": "李清泉",
        "inv2026": "",
        "rec2026": "",
        "date": ""
    },
    "12": {
        "status": "已完成",
        "coordinator": "",
        "inv2025": "陈汉文",
        "inv2026": "陈汉文",
        "rec2026": "窦婷",
        "date": "2026年5月12日"
    },
    "13": {
        "status": "未认领",
        "coordinator": "陈培涛(小PT)",
        "inv2025": "",
        "inv2026": "",
        "rec2026": "",
        "date": ""
    },
    "14": {
        "status": "未认领",
        "coordinator": "陈培涛(小PT)",
        "inv2025": "",
        "inv2026": "",
        "rec2026": "",
        "date": ""
    },
    "15": {
        "status": "已完成",
        "coordinator": "",
        "inv2025": "蒋文博",
        "inv2026": "蒋文博",
        "rec2026": "蒋枫媛",
        "date": "2026年5月2日"
    },
    "16": {
        "status": "未认领",
        "coordinator": "蔡振远(阿暖)",
        "inv2025": "区祥敏",
        "inv2026": "",
        "rec2026": "",
        "date": ""
    },
    "17": {
        "status": "未认领",
        "coordinator": "蔡振远(阿暖)",
        "inv2025": "胡勇婕",
        "inv2026": "",
        "rec2026": "",
        "date": ""
    },
    "18": {
        "status": "已完成",
        "coordinator": "",
        "inv2025": "冯超宝",
        "inv2026": "冯超宝",
        "rec2026": "崔军亚",
        "date": "2026年4月27日"
    },
    "19": {
        "status": "未认领",
        "coordinator": "蔡振远(阿暖)",
        "inv2025": "罗天雅",
        "inv2026": "赖辰炫",
        "rec2026": "冯晓斌",
        "date": "2026年5月22日"
    },
    "20": {
        "status": "未认领",
        "coordinator": "陈培涛(小PT)",
        "inv2025": "盛荷苗",
        "inv2026": "",
        "rec2026": "",
        "date": ""
    },
    "21": {
        "status": "未认领",
        "coordinator": "陈培涛(小PT)",
        "inv2025": "王彬",
        "inv2026": "",
        "rec2026": "",
        "date": ""
    },
    "22": {
        "status": "已完成",
        "coordinator": "",
        "inv2025": "",
        "inv2026": "刘守国",
        "rec2026": "王潮漪",
        "date": "2026年5月4日"
    },
    "23": {
        "status": "未认领",
        "coordinator": "陈培涛(小PT)",
        "inv2025": "",
        "inv2026": "",
        "rec2026": "",
        "date": ""
    },
    "24": {
        "status": "未认领",
        "coordinator": "陈培涛(小PT)",
        "inv2025": "",
        "inv2026": "",
        "rec2026": "",
        "date": ""
    },
    "25": {
        "status": "已完成",
        "coordinator": "",
        "inv2025": "罗文洋",
        "inv2026": "李诗奇",
        "rec2026": "王晓佳",
        "date": "2026年5月9日"
    },
    "26": {
        "status": "已完成",
        "coordinator": "",
        "inv2025": "",
        "inv2026": "陈彤",
        "rec2026": "沈若枢",
        "date": "2026年4月30日"
    },
    "27": {
        "status": "已完成",
        "coordinator": "",
        "inv2025": "",
        "inv2026": "叶海兵",
        "rec2026": "黄桢雅",
        "date": "2026年4月26日"
    },
    "28": {
        "status": "已完成",
        "coordinator": "",
        "inv2025": "李旭坤",
        "inv2026": "李旭坤",
        "rec2026": "文舒晴",
        "date": "2026年5月10日"
    },
    "29": {
        "status": "未认领",
        "coordinator": "蔡振远(阿暖)",
        "inv2025": "刘星池",
        "inv2026": "",
        "rec2026": "",
        "date": ""
    },
    "30": {
        "status": "已完成",
        "coordinator": "",
        "inv2025": "谢海莹",
        "inv2026": "谢海莹",
        "rec2026": "肖颖",
        "date": "2026年5月4日"
    },
    "31": {
        "status": "未认领",
        "coordinator": "陈培涛(小PT)",
        "inv2025": "陈桧华",
        "inv2026": "",
        "rec2026": "",
        "date": ""
    },
    "32": {
        "status": "已完成",
        "coordinator": "",
        "inv2025": "",
        "inv2026": "冯炳昌",
        "rec2026": "陈金珍",
        "date": "2026年5月1日"
    },
    "33": {
        "status": "已完成",
        "coordinator": "",
        "inv2025": "",
        "inv2026": "邱童",
        "rec2026": "董晓燃",
        "date": "2026年4月26日"
    },
    "34": {
        "status": "未认领",
        "coordinator": "陈培涛(小PT)",
        "inv2025": "",
        "inv2026": "",
        "rec2026": "",
        "date": ""
    },
    "35": {
        "status": "未认领",
        "coordinator": "陈培涛(小PT)",
        "inv2025": "",
        "inv2026": "",
        "rec2026": "",
        "date": ""
    },
    "36": {
        "status": "未认领",
        "coordinator": "蔡振远(阿暖)",
        "inv2025": "刘瑾青",
        "inv2026": "",
        "rec2026": "",
        "date": ""
    },
    "37": {
        "status": "已完成",
        "coordinator": "",
        "inv2025": "刘瑾青",
        "inv2026": "刘瑾青",
        "rec2026": "贺文雄",
        "date": "2026年5月13日"
    },
    "38": {
        "status": "未认领",
        "coordinator": "蔡振远(阿暖)",
        "inv2025": "江泳",
        "inv2026": "",
        "rec2026": "",
        "date": ""
    },
    "39": {
        "status": "已完成",
        "coordinator": "",
        "inv2025": "郑炜",
        "inv2026": "郑炜",
        "rec2026": "郑文郗",
        "date": "2026年5月2日"
    },
    "40": {
        "status": "未认领",
        "coordinator": "蔡振远(阿暖)",
        "inv2025": "江泳",
        "inv2026": "",
        "rec2026": "",
        "date": ""
    },
    "41": {
        "status": "未认领",
        "coordinator": "蔡振远(阿暖)",
        "inv2025": "梁周子涵",
        "inv2026": "",
        "rec2026": "",
        "date": ""
    },
    "42": {
        "status": "未认领",
        "coordinator": "姚彩红(鸺鹠)",
        "inv2025": "郭布衣",
        "inv2026": "",
        "rec2026": "",
        "date": ""
    },
    "43": {
        "status": "已完成",
        "coordinator": "",
        "inv2025": "",
        "inv2026": "黄建粤",
        "rec2026": "陈秋燕",
        "date": "2026年5月10日"
    },
    "44": {
        "status": "已完成",
        "coordinator": "",
        "inv2025": "",
        "inv2026": "邱童",
        "rec2026": "董晓燃",
        "date": "2026年5月1日"
    },
    "45": {
        "status": "已完成",
        "coordinator": "",
        "inv2025": "",
        "inv2026": "王彬",
        "rec2026": "赵家宏",
        "date": "2026年5月6日"
    },
    "46": {
        "status": "未认领",
        "coordinator": "姚彩红(鸺鹠)",
        "inv2025": "",
        "inv2026": "",
        "rec2026": "",
        "date": ""
    },
    "47": {
        "status": "待调查",
        "coordinator": "蔡振远(阿暖)",
        "inv2025": "刘瑾青",
        "inv2026": "刘瑾青",
        "rec2026": "许筱凰",
        "date": "2026年5月27日"
    },
    "48": {
        "status": "未认领",
        "coordinator": "蔡振远(阿暖)",
        "inv2025": "郑炜",
        "inv2026": "",
        "rec2026": "",
        "date": ""
    },
    "49": {
        "status": "未认领",
        "coordinator": "蔡振远(阿暖)",
        "inv2025": "宋勇",
        "inv2026": "",
        "rec2026": "",
        "date": ""
    },
    "50": {
        "status": "已完成",
        "coordinator": "",
        "inv2025": "",
        "inv2026": "梁颖琳",
        "rec2026": "吴宪",
        "date": "2026年5月1日"
    },
    "51": {
        "status": "已完成",
        "coordinator": "",
        "inv2025": "",
        "inv2026": "袁翊朗",
        "rec2026": "刘咪咪",
        "date": "2026年5月4日"
    },
    "52": {
        "status": "已完成",
        "coordinator": "",
        "inv2025": "",
        "inv2026": "杨柏骅",
        "rec2026": "黄凯骐",
        "date": "2026年5月1日"
    },
    "53": {
        "status": "未认领",
        "coordinator": "姚彩红(鸺鹠)",
        "inv2025": "",
        "inv2026": "",
        "rec2026": "",
        "date": ""
    },
    "54": {
        "status": "未认领",
        "coordinator": "姚彩红(鸺鹠)",
        "inv2025": "",
        "inv2026": "",
        "rec2026": "",
        "date": ""
    },
    "55": {
        "status": "未认领",
        "coordinator": "姚彩红(鸺鹠)",
        "inv2025": "",
        "inv2026": "",
        "rec2026": "",
        "date": ""
    },
    "56": {
        "status": "已完成",
        "coordinator": "",
        "inv2025": "",
        "inv2026": "江舸",
        "rec2026": "余美群",
        "date": "2026年5月1日"
    },
    "57": {
        "status": "已完成",
        "coordinator": "",
        "inv2025": "",
        "inv2026": "郭布衣",
        "rec2026": "王培珍",
        "date": "2026年4月26日"
    },
    "58": {
        "status": "已完成",
        "coordinator": "",
        "inv2025": "",
        "inv2026": "陈玥彤",
        "rec2026": "冯炳昌",
        "date": "2026年4月26日"
    },
    "59": {
        "status": "待调查",
        "coordinator": "蔡振远(阿暖)",
        "inv2025": "江泳",
        "inv2026": "",
        "rec2026": "",
        "date": "2026年5月22日"
    },
    "60": {
        "status": "未认领",
        "coordinator": "蔡振远(阿暖)",
        "inv2025": "宋勇",
        "inv2026": "",
        "rec2026": "",
        "date": ""
    },
    "61": {
        "status": "已完成",
        "coordinator": "",
        "inv2025": "",
        "inv2026": "叶海兵",
        "rec2026": "孔璇敏",
        "date": "2026年5月5日"
    },
    "62": {
        "status": "未认领",
        "coordinator": "姚彩红(鸺鹠)",
        "inv2025": "郭布衣",
        "inv2026": "",
        "rec2026": "",
        "date": ""
    },
    "63": {
        "status": "待调查",
        "coordinator": "姚彩红(鸺鹠)",
        "inv2025": "谢海莹、郭布衣",
        "inv2026": "郭布衣",
        "rec2026": "冯炳昌",
        "date": "2026年5月24日"
    },
    "64": {
        "status": "未认领",
        "coordinator": "姚彩红(鸺鹠)",
        "inv2025": "",
        "inv2026": "",
        "rec2026": "",
        "date": ""
    },
    "65": {
        "status": "已完成",
        "coordinator": "",
        "inv2025": "",
        "inv2026": "刘韵莉",
        "rec2026": "汤立群",
        "date": "2026年5月16日"
    },
    "66": {
        "status": "待调查",
        "coordinator": "姚彩红(鸺鹠)",
        "inv2025": "江泳",
        "inv2026": "赖灶芳",
        "rec2026": "罗海燕",
        "date": "2026年5月24日"
    },
    "67": {
        "status": "已完成",
        "coordinator": "",
        "inv2025": "",
        "inv2026": "陈培涛",
        "rec2026": "王雨佳",
        "date": "2026年4月26日"
    },
    "68": {
        "status": "未认领",
        "coordinator": "姚彩红(鸺鹠)",
        "inv2025": "江泳",
        "inv2026": "",
        "rec2026": "",
        "date": ""
    },
    "69": {
        "status": "已完成",
        "coordinator": "",
        "inv2025": "",
        "inv2026": "严笑芬",
        "rec2026": "龙茹丹",
        "date": "2026年5月8日"
    },
    "70": {
        "status": "待调查",
        "coordinator": "蔡振远(阿暖)",
        "inv2025": "",
        "inv2026": "窦婷",
        "rec2026": "郭倩文",
        "date": "2026年5月25日"
    },
    "71": {
        "status": "已完成",
        "coordinator": "",
        "inv2025": "",
        "inv2026": "熊之",
        "rec2026": "冯嘉良",
        "date": "2026年5月2日"
    },
    "72": {
        "status": "已完成",
        "coordinator": "",
        "inv2025": "赖灶芳",
        "inv2026": "赖灶芳",
        "rec2026": "罗海燕",
        "date": "2026年5月3日"
    },
    "73": {
        "status": "待调查",
        "coordinator": "姚彩红(鸺鹠)",
        "inv2025": "",
        "inv2026": "徐建敏",
        "rec2026": "姚彩红",
        "date": "2026年5月22日"
    },
    "74": {
        "status": "已完成",
        "coordinator": "",
        "inv2025": "",
        "inv2026": "陈彤",
        "rec2026": "徐建敏",
        "date": "2026年5月3日"
    },
    "75": {
        "status": "待调查",
        "coordinator": "姚彩红(鸺鹠)",
        "inv2025": "",
        "inv2026": "罗海燕",
        "rec2026": "赖灶芳",
        "date": "2026年5月23日"
    },
    "76": {
        "status": "已完成",
        "coordinator": "",
        "inv2025": "",
        "inv2026": "连科",
        "rec2026": "王珂",
        "date": "2026年5月2日"
    },
    "77": {
        "status": "已完成",
        "coordinator": "",
        "inv2025": "",
        "inv2026": "黎雨葳",
        "rec2026": "赵楚君",
        "date": "2026年5月17日"
    },
    "78": {
        "status": "未认领",
        "coordinator": "姚彩红(鸺鹠)",
        "inv2025": "",
        "inv2026": "",
        "rec2026": "",
        "date": ""
    },
    "79": {
        "status": "待调查",
        "coordinator": "姚彩红(鸺鹠)",
        "inv2025": "",
        "inv2026": "谢海莹",
        "rec2026": "蒋彩玲",
        "date": "2026年5月23日"
    },
    "80": {
        "status": "待调查",
        "coordinator": "姚彩红(鸺鹠)",
        "inv2025": "",
        "inv2026": "姚彩红",
        "rec2026": "董晓燃",
        "date": "2026年5月23日"
    },
    "81": {
        "status": "未认领",
        "coordinator": "姚彩红(鸺鹠)",
        "inv2025": "江泳",
        "inv2026": "",
        "rec2026": "",
        "date": ""
    },
    "82": {
        "status": "已完成",
        "coordinator": "",
        "inv2025": "",
        "inv2026": "严笑芬",
        "rec2026": "龙茹丹",
        "date": "2026年5月7日"
    }
};
